OCTYPE html>
<html>
<head><title>урок 11</title>
</head>
<body>
<h1>Функции. Начало.</h1>
<p>Создайте функцию, которая будет принимать
    параметры: имя, адрес проживания, адрес регистрации, возраст, пол человека.
    Результатом работы данной функции должен
    быть вывод информации.</p>
</body>
</html>
<?php
function pech($a2,$a1){
    $rez= "$a1 $a2";
    return $rez;
}
$a1=('May Maus');
$a2= ('имя- ');
echo pech($a1,$a2)."<br>";
$a1 = ('Moskov, alleya Vitte,6 building 1, 10');
$a2 = ('адрес проживания- ');
echo pech($a1,$a2)."<br>";
$a1 = ('51');
$a2 = ('человеку- ');
$st=$a1%10;
if (($st==0)||($st==5)||($st==6)||($st==7)||($st==8)||($st==9)){
    $mod=' лет';
}
if ($st==1) {
    $mod=' год';
}
if (($st==2) || ($st==3) || ($st==4)){
    $mod=' года';
}
if ($a1==11){
    $mod='лет';}

echo pech($a1,$a2),$mod."<br>";


